Tekla.Structures.Dialog.PluginDialogHandler
A class that handles the creation and management of plugin dialogs.

Tekla.Structures.Dialog.PluginDialogHandler.#ctor(System.Type)
Constructor for creating a plugin dialog handler.
type: The type of the plugin

Tekla.Structures.Dialog.PluginDialogHandler.InitializePluginDialog
Creates and initializes the plugin dialog and stores the instance

Tekla.Structures.Dialog.PluginDialogHandler.Reload
Reloads the dialog without storing the instance

Tekla.Structures.Dialog.PluginDialogHandler.Show
Show the dialog

Tekla.Structures.Dialog.PluginDialogHandler.PerformDialogGet
Method for getting dialog values.

Tekla.Structures.Dialog.PluginDialogHandler.RefreshForm(System.Action)
Method for performing dialog form refresh when opened while already open.

Tekla.Structures.Dialog.PluginDialogHandler.LoadTemporarily
Load the dialog temporarily and use the temporary data storage.

Tekla.Structures.Dialog.PluginDialogHandler.CloseDialog
Close the dialog and reset the instance.

Tekla.Structures.Dialog.PluginDialogHandler.Localize
Load and apply localization to the dialog.
Returns: